rottenpotatoes/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 5]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]
---
  def similar
    id = params[:id] # retrieve movie ID from URI route
    movie = Movie.find(id) # look up movie by unique ID
    if movie.director.nil? || movie.director.empty?